# 

FITTINGS_MAP = {

    # =====================================
    # КОНФІРМАТИ
    # =====================================

    "confirmat_7x50": {
        "article": "190106",
        "name": "Конфірмат 7x50"
    },

    # =====================================
    # ШКАНТИ
    # =====================================

    "dowel_8x30": {
        "article": "190212",
        "name": "Шкант 8x30"
    },

    # =====================================
    # МІНІФІКС
    # =====================================

    "minifix_cam": {
        "article": "61281",
        "name": "Мініфікс ексцентрик"
    },

    "minifix_bolt": {
        "article": "57722",
        "name": "Дюбель під мініфікс"
    },

    # =====================================
    # РАФІКС
    # =====================================

    "rafix_cam": {
        "article": "84629",
        "name": "Рафікс"
    },
    "rafix__bolt": {
        "article": "61136",
        "name": "Дюбель під рафікс"
    },

    # =====================================
    # НІЖКИ
    # =====================================

    "leg_50": {
        "article": "131761",
        "name": "Ніжка регульована 50мм"
    },

    # =====================================
    # САМОРІЗИ
    # =====================================

    "screw_3_5x16": {
        "article": "190256",
        "name": "Саморіз 3.5x16"
    }
}