from services.gap_config import (
    GAP_CONFIG
)


# =====================================================
# GAP ENGINE
# Система зазорів
# =====================================================


# =====================================================
# ОТРИМАТИ ЗАЗОР ФАСАДУ
# =====================================================

def get_facade_gap():

    return GAP_CONFIG[
        "facade"
    ]
# =====================================================
# OVERLAY
# =====================================================

def get_facade_overlay():

    return GAP_CONFIG[
        "facade"
    ][
        "overlay"
    ]

# =====================================================
# ОТРИМАТИ ЗАЗОРИ ШУХЛЯД
# =====================================================

def get_drawer_gaps():

    return GAP_CONFIG[
        "drawer"
    ]


# =====================================================
# MOVENTO
# =====================================================

def get_movento_side_gap():

    return GAP_CONFIG[
        "drawer"
    ][
        "movento_side_gap"
    ]


# =====================================================
# TANDEM
# =====================================================

def get_tandem_side_gap():

    return GAP_CONFIG[
        "drawer"
    ][
        "tandem_side_gap"
    ]


# =====================================================
# INNER CLEARANCE
# =====================================================

def get_inner_clearance():

    return GAP_CONFIG[
        "carcass"
    ][
        "inner_clearance"
    ]