# =====================================================
# GROOVE ENGINE
# Пази
# =====================================================


# =====================================================
# HDF GROOVE
# =====================================================

def create_hdf_bottom_groove():

    return {

        "type": "bottom_groove",

        # Відступ від низу
        "offset": 10,

        # Глибина пазу
        "depth": 10,

        # Висота пазу
        "height": 4,

        # Тип дна
        "bottom_type": "HDF"
    }


# =====================================================
# DSP GROOVE
# =====================================================

def create_dsp_bottom_groove():

    return {

        "type": "bottom_groove",

        "offset": 16,

        "depth": 12,

        "height": 16,

        "bottom_type": "DSP"
    }