# =====================================================
# ГЕОМЕТРІЯ ДЕТАЛЕЙ
# =====================================================

# length -> довга сторона
# width -> коротка сторона
# thickness -> товщина


# =====================================================
# СТВОРЕННЯ ГЕОМЕТРІЇ ДЕТАЛІ
# =====================================================

def create_part_geometry(

    length,
    width,
    thickness,

    grain="vertical",

    material="dsp_18"
):

    return {

        # Геометрія
        "length": round(length, 2),

        "width": round(width, 2),

        "thickness": thickness,

        # Напрям текстури
        "grain": grain,

        # Матеріал
        "material": material
    }


# =====================================================
# ДОДАТИ ГЕОМЕТРІЮ ДО ДЕТАЛІ
# =====================================================

def apply_geometry(
    part,
    geometry
):

    part["geometry"] = geometry

    return part


# =====================================================
# ВЕРТИКАЛЬНА ТЕКСТУРА
# =====================================================

def vertical_grain():

    return "vertical"


# =====================================================
# ГОРИЗОНТАЛЬНА ТЕКСТУРА
# =====================================================

def horizontal_grain():

    return "horizontal"